'''
Model - відповідає за керування меню та замовленнями.
Цей модуль відповідає за зберігання та управління інформацією
про доступні страви та поточне замовлення користувача.

Основні функції:
- get_menu (отримання списка меню)
- add_item_to_order (додавання товару до поточного замовлення)
- get_order (отримання поточного замовлення)

Особливості:
- Без підключення до бази даних
- Меню у вигляді словника з унікальним ID та характеристиками
- В замовлення можна додавати товари із вказаною кількістю
- Є перевірка наявності ID перед додаванням
'''

class SushiMenu:
    def __init__(self):
        self.menu = {
            1: {"name": "Каліфорнія з креветкою в кунжуті", "price": 219},
            2: {"name": "Футомакі з лососем", "price": 279},
            3: {"name": "Кранч з креветкою", "price": 299},
            4: {"name": "Філадельфія з лососем", "price": 299},
            5: {"name": "Рол запечений з крабовим міксом", "price": 189},
            6: {"name": "Темпура рол з вугрем", "price": 329},
            7: {"name": "Місо суп з лососем", "price": 99},
            8: {"name": "Локшина удон з куркою", "price": 229},
            9: {"name": "Рисові чипси", "price": 59},
            10: {"name": "Моті", "price": 119}
        }
        self.order = []

    def get_menu(self):
        return self.menu

    def add_item_to_order(self, item_id, quantity):
        if item_id in self.menu:
            self.order.append({"id": item_id, "quantity": quantity})
        else:
            raise ValueError("Невірний ID товару")

    def get_order(self):
        return self.order